public/blog/pinebook-pro/pinebook-pro-custom-kernel/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Queztaz/Pinebook Pro Custom Kernel</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Pinebook Pro Custom Kernel</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Custom Kernel</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Setting up our enviroment</a>
<ul>
<li><a href="#headline-4">Dependencies</a>
</li>
<li><a href="#headline-5">Compiling the kernel</a>
</li>
<li><a href="#headline-6">Installing the kernel</a>
</li>
</ul>
</li>
<li><a href="#headline-7">UBOOT (IMPORTANT)</a>
</li>
<li><a href="#headline-8">ENCRYPTION</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Custom Kernel
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Here&#39;s how to compile <a href="https://gitlab.manjaro.org/tsys/linux-pinebook-pro">tsys&#39;</a> mainline linux kernel for the Pinebook Pro.
I&#39;m using the &#34;debian way&#34; of installing the kernel.
When compiling the kernel, we can tell &#34;make&#34; to package the binaries as multiple debian archive files (.deb).
Afterward, we can simple run &#34;dpkg -i .deb&#34; to install it.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Setting up our enviroment
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Dependencies
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
Compilation dependencies</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>sudo apt-get install linux-headers-<span style="color:#66d9ef">$(</span>uname -r<span style="color:#66d9ef">)</span> libncurses-dev gawk flex bison openssl libssl-dev dkms libelf-dev libudev-dev libpci-dev libiberty-dev autoconf bc fakeroot</span></span></code></pre></div>
</div>
<p>
Linux Source Files</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>git clone --depth<span style="color:#f92672">=</span><span style="color:#ae81ff">1</span> https://gitlab.manjaro.org/tsys/linux-pinebook-pro
</span></span><span style="display:flex;"><span>cd linux-pinebook-pro</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Compiling the kernel
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>The <code>ARCH</code> variable specifies the target machines architecture.</p>
<p>
The <code>CROSS_COMPILE</code> variable specifies which compiler the system should use.</p>
<p>
Running &#34;make menuconfig&#34; opens an ncurses menu which you can use to modify the kernel.
You don&#39;t need to change anything.
Run the command and exit the ncurses menu to save the kernel configuration to &#34;$PWD/.config&#34;</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>export ARCH<span style="color:#f92672">=</span>arm64
</span></span><span style="display:flex;"><span>export CROSS_COMPILE<span style="color:#f92672">=</span>aarch64-linux-gnu
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Exit the ncurses menu to save the default config</span>
</span></span><span style="display:flex;"><span>make -j <span style="color:#ae81ff">6</span> menuconfig
</span></span><span style="display:flex;"><span>make -j <span style="color:#ae81ff">6</span> deb-pkg</span></span></code></pre></div>
</div>
<p>
The compiling process should take about two hours. My pinebook was left on a desk and stayed consistently at 68.4-69.8 degrees Celsius.
The output deb files are in &#34;../&#34;</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Installing the kernel
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>I forgot the exact names of the output deb files.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>sudo dpkg -i linux-headers-*.deb
</span></span><span style="display:flex;"><span>sudo dpkg -i linux-image-*.deb
</span></span><span style="display:flex;"><span>sudo dpkg -i linux-libc-*.deb</span></span></code></pre></div>
</div>
<p>
<strong>DON&#39;T REBOOT YET!</strong> It turns out that uboot, at least from the debian
installer, isn&#39;t compiled with a gzip decompressor.
If you haven&#39;t noticed, your linux kernel and initrd are actually both
gzip archives!
This confused the heck out of me at first. You&#39;ll need to decompress the files and put them back in /boot</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># We need to rename them with the suffix &#34;.gz&#34; or else gzip returns errors</span>
</span></span><span style="display:flex;"><span>cd ~
</span></span><span style="display:flex;"><span>mv /boot/vmlinuz-5.10.0-rc5-1-pinebookpro-arm64+ ~/vmlinuz-5.10.0-rc5-1-pinebookpro-arm64+.gz
</span></span><span style="display:flex;"><span>gzip -d ~/vmlinuz-5.10.0-rc5-1-pinebookpro-arm64+.gz
</span></span><span style="display:flex;"><span>mv ~/vmlinuz-5.10.0-rc5-1-pinebookpro-arm64+ /boot/
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>mv /boot/initrd.img-5.10.0-rc5-1-pinebookpro-arm64+ ~/initrd.img-5.10.0-rc5-1-pinebookpro-arm64+.gz
</span></span><span style="display:flex;"><span>gzip -d ~/initrd.img-5.10.0-rc5-1-pinebookpro-arm64+.gz
</span></span><span style="display:flex;"><span>mv ~/initrd.img-5.10.0-rc5-1-pinebookpro-arm64+</span></span></code></pre></div>
</div>
<p>
<strong>DONE!</strong> You can boot into your new mainline kernel now.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
UBOOT (IMPORTANT)
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>
Remove &#34;maxcpus=4&#34; from /boot/extlinux/extlinux.conf</p>
<p>
This option was automatically added and is supposed to make boot times
faster.
Just remove it from the uboot config. The boot times are fine without
it and are infact LONGER if you keep it.</p>
<p>
FYI: Normally the default kernel re-enables the two large cores once
it&#39;s booted. For some reason this one does not.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>## /boot/extlinux/extlinux.conf
</span></span><span style="display:flex;"><span>default 10
</span></span><span style="display:flex;"><span>menu title U-Boot menu
</span></span><span style="display:flex;"><span>prompt 0
</span></span><span style="display:flex;"><span>timeout 10
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>label l0
</span></span><span style="display:flex;"><span>        menu label Debian GNU/Linux bullseye/sid 5.10.0-rc5-1-pinebookpro-arm64+
</span></span><span style="display:flex;"><span>        linux /vmlinuz-5.10.0-rc5-1-pinebookpro-arm64+
</span></span><span style="display:flex;"><span>        initrd /initrd.img-5.10.0-rc5-1-pinebookpro-arm64+
</span></span><span style="display:flex;"><span>        fdt /rk3399-pinebook-pro.dtb
</span></span><span style="display:flex;"><span>        append root=PARTLABEL=mmcblk1-RootFS console=ttyS2,1500000n8 console=tty0 ro quiet splash plymouth.ignore-serial-consoles maxcpus=6 coherent_pool=1M</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
ENCRYPTION
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>I couldn&#39;t boot from my encrypted debian install.
According to <a href="https://forum.pine64.org/showthread.php?tid=8765">this post</a>, you can update your initrd to include modules to decrypt the file system, but the display won&#39;t work.
I couldn&#39;t even get a prompt to appear using the serial console when attempting this.
I&#39;m opting for an encrypted home partition instead.</p>
</div>
</div>

  </article>
</main>

</body>
</html>
